import { Container } from "solid-bootstrap"
import { Component } from "solid-js";
import styles from '../../App.module.css';

const LectureSoilPerliteVermiculite: Component = () => {
    return (
        <Container class={styles.Lecture}>
            <div>
                <h2>Перлит и вермикулит</h2>
                <div style={{ "text-align": "left" }}>
                    <p>
                        Перлит е карпа од вулканско потекло. По изглед, перлитот наликува на
                        лабави, светло сиви или бели гранули, слични на кршен полистирен.
                        Агроперлитот не содржи хранливи материи, но поради неговата светлина,
                        порозна структура, станува погодна компонента за мешавина на почвата.
                    </p>
                    <p>
                        Вермикулит е хемиски инертен материјал, хидромика. Изгледа како мали златни
                        кафеави или сребрени чинии со неправилна форма. Топлински преработен во печката,
                        калциниран вермикулит се нарекува агровермимулит. Овој материјал, за разлика
                        од агроперлитот, содржи многу елементи во трагови корисни за растенијата во
                        достапна форма. Вермикулитот е многу впивач на влага, може да впие и држи дури
                        4 пати повеќе количина вода од сопствената тежина.
                    </p>
                </div>
            </div>
        </Container>
    );
}

export default LectureSoilPerliteVermiculite;