import { Container } from "solid-bootstrap";
import styles from "../../App.module.css";
import { Component } from "solid-js";

const LectureSoilHumusSand: Component = () => {
    return (
        <Container class={styles.Lecture}>
            <div>
                <h2>
                    Хумус и песок
                </h2>
                <div style={{ "text-align": "left" }}>
                    <p>
                        Хумус е супстанција што е резултат на распаѓање на органски остатоци.  Ова распаѓање се јавува
                        благодарение на организмите и микроорганизмите, како што се габите и бактериите. Има темно
                        кафеава боја речиси црна, главно поради високата содржина на јаглерод. Хумусот обезбедува
                        хранливи материи за растенијата, најчесто мешано со обична почва за да се подобри составот.
                        Корените на растенијата можат многу добро да се асимилираат и тоа брзо. Практично секое растение
                        може да опстои, тропските и пустинските растенија само може да имаат потешкотии да расте.
                    </p>
                    <p>
                        Песок е поразличен од обична почва најмногу во тоа што песокта има многу добра дренажа.
                        Недостаток на песокта како медиум за растенија е тоа што нема многу органска материја,
                        може песокта да се подобри со тоа што ќе се додаде ѓубриво, воедно ќе може да задржува и повеќе
                        вода. Бидејќи е лесна и порозна, водата многу брзо се филтрира, најпогодно е за растенија со
                        ниски нутриционистички потреби.
                    </p>
                </div>
            </div>
        </Container>
    );
}

export default LectureSoilHumusSand;