import { Container, Tab, Tabs } from "solid-bootstrap";
import { Component } from "solid-js";
import GallerySoil from "./GallerySoil";
import LecturePage from "./LecturePage";

const LectureSoil: Component = () => {
    return (
        <Container>
            <h1>Почва</h1>
            <Tabs
                defaultActiveKey="lectureSoilBasic"
                id="uncontrolled-tab-example"
                class="mb-3"
            >
                <Tab eventKey="lectureSoilBasic" title="Основни Информации">
                    <LecturePage title='Основни информации'>
                        <ul>
                            <li>Познати медиуми за почва:</li>
                            <ul>
                                <li>Хумус</li>
                                <li>Перлит</li>
                                <li>Песок</li>
                                <li>Кокосови влакна</li>
                                <li>Глина</li>
                                <li>Перлит или вермикулит</li>
                                <li>Кора од дрво</li>
                            </ul>
                            <li>Најчесто медиумите се мешаат со различни соодноси за секое растение посебно</li>
                            <li>рН вредност на просечна почва за садење: 5,5 - 7,5</li>
                            <li>Различен медиум - различни карактеристики</li>
                        </ul>
                    </LecturePage>
                </Tab>
                <Tab eventKey="lectureHumusSand" title="Хумус и песок">
                    <LecturePage title="Хумус и песок">
                        <p>
                            Хумус е супстанција што е резултат на распаѓање на органски остатоци.  Ова распаѓање се јавува
                            благодарение на организмите и микроорганизмите, како што се габите и бактериите. Има темно
                            кафеава боја речиси црна, главно поради високата содржина на јаглерод. Хумусот обезбедува
                            хранливи материи за растенијата, најчесто мешано со обична почва за да се подобри составот.
                            Корените на растенијата можат многу добро да се асимилираат и тоа брзо. Практично секое растение
                            може да опстои, тропските и пустинските растенија само може да имаат потешкотии да расте.
                        </p>
                        <p>
                            Песок е поразличен од обична почва најмногу во тоа што песокта има многу добра дренажа.
                            Недостаток на песокта како медиум за растенија е тоа што нема многу органска материја,
                            може песокта да се подобри со тоа што ќе се додаде ѓубриво, воедно ќе може да задржува и повеќе
                            вода. Бидејќи е лесна и порозна, водата многу брзо се филтрира, најпогодно е за растенија со
                            ниски нутриционистички потреби.
                        </p>
                    </LecturePage>
                </Tab>
                <Tab eventKey="lecturePerliteVermiculite" title="Перлит и вермикулит">
                    <LecturePage title="Перлит и вермикулит">
                        <p>
                            Перлит е карпа од вулканско потекло. По изглед, перлитот наликува на
                            лабави, светло сиви или бели гранули, слични на кршен полистирен.
                            Агроперлитот не содржи хранливи материи, но поради неговата светлина,
                            порозна структура, станува погодна компонента за мешавина на почвата.
                        </p>
                        <p>
                            Вермикулит е хемиски инертен материјал, хидромика. Изгледа како мали златни
                            кафеави или сребрени чинии со неправилна форма. Топлински преработен во печката,
                            калциниран вермикулит се нарекува агровермимулит. Овој материјал, за разлика
                            од агроперлитот, содржи многу елементи во трагови корисни за растенијата во
                            достапна форма. Вермикулитот е многу впивач на влага, може да впие и држи дури
                            4 пати повеќе количина вода од сопствената тежина.
                        </p>

                    </LecturePage>
                </Tab>
                <Tab eventKey="lectureTreeBarkCoconutHusk" title="Кора од дрво и кокосови влакна">
                    <LecturePage title="Кора од дрво и кокосови влакна">
                        <p>
                            Кора од дрво се користи како поглавен медиум во почва за тропски растенија, но
                            исто така и како прекривка за во градина бидејќи не држи многу вода и е доста
                            воздушест. За орхидеи само се користи кора од дрво како единствен медиум за почва.
                        </p>
                        <p>
                            Кокосови влакна се соодветни за секој тип на растение освен за месојадните. Медиум со
                            кокосови влакна е способен да ги задржува хранливите материи и да ги ослободува постепено.
                            Одржува соодветна рамнотежа помеѓу задржувањето на водата и капацитетот за аерација.
                        </p>
                    </LecturePage>
                </Tab>
                <Tab eventKey="gallery" title="Галерија">
                    <GallerySoil />
                </Tab>
            </Tabs>
        </Container>
    );
}

export default LectureSoil;