import { Container } from "solid-bootstrap";
import { Component } from "solid-js";
import styles from "../App.module.css";

const LectureLightFlower: Component = () => {
  return (
    <Container class={styles.Lecture}>
      <div>
        <h2>Светлина, цвет и пропагација</h2>
        <div style={{"text-align": "left"}}>
          <p>
            Орхидеите бараат недиректна светлина, поточно, што посветло а да не
            горат листовите. Специфични бројки за светлниа се од 21527 до 43055
            лумени на метар квадратен. Можат да опстојат и во потемна светлина но
            нема да имаат доволно светлина за да произведуваат цветови но пак да
            се здрави и бујни. Доколку сакате орхидеата да произведува цвет тогаш
            треба да гледате листовите да бидат жолто-зелени со силни исправени
            корења, темно зелени листови значи дека иако има доволно светлина за
            да преживее и расте убаво, нема да произведува цвет.
          </p>
          <p>
            Доколку орхидеата е задоволна од околината (соодветен медиум за почва,
            доволно прихрана, вода, светлина, температура и циркулација на
            воздухот) ќе произведува цветови кои типично траат 6-10 недели но може
            да цвета цела година. Околу периодот на цветање најдобра опција ќе
            биде во период кога сакате да цвети, да се купи веќе расцветана
            орхидеа. Постојат повеќе бои за цветот на орхидеата, како виолетово, розево, бело,
            жолто, портокалово, црвено, така што центарот на цветот е најчесто розев или црвен.
          </p>
        </div>
      </div>
    </Container>
  );
};
export default LectureLightFlower;
